In [2]:

# importing pandas as pd
import pandas as pd
 
# Creating a dict of lists 
data = {'Name':["Akash", "Geeku", "Pankaj", "Sumitra","Ramlal"],
       'Branch':["B.Tech", "MBA", "BCA", "B.Tech", "BCA"],
       'Score':["80","90","60", "30", "50"],
       'Result': ["Pass","Pass","Pass","Fail","Fail"]}
 
# creating a dataframe 
df = pd.DataFrame(data)
  
df

      Name  Branch Score Result
0    Akash  B.Tech    80   Pass
1    Geeku     MBA    90   Pass
2   Pankaj     BCA    60   Pass
3  Sumitra  B.Tech    30   Fail
4   Ramlal     BCA    50   Fail

## Using set_index() method

In [11]:
df1=df.set_index('Name')
df1

         Branch Score Result
Name
Akash    B.Tech    80   Pass
Geeku       MBA    90   Pass
Pankaj      BCA    60   Pass
Sumitra  B.Tech    30   Fail
Ramlal      BCA    50   Fail

In [12]:
df1.index.name

'Name'

In [13]:
df1.index.name=None

In [14]:
df1

         Branch Score Result
Akash    B.Tech    80   Pass
Geeku       MBA    90   Pass
Pankaj      BCA    60   Pass
Sumitra  B.Tech    30   Fail
Ramlal      BCA    50   Fail

## Using pivot() method.

In [15]:
df

      Name  Branch Score Result
0    Akash  B.Tech    80   Pass
1    Geeku     MBA    90   Pass
2   Pankaj     BCA    60   Pass
3  Sumitra  B.Tech    30   Fail
4   Ramlal     BCA    50   Fail

In [21]:
df.pivot(index='Name',columns=['Branch'],values='Score')

Branch  B.Tech  BCA  MBA
Name
Akash       80  NaN  NaN
Geeku      NaN  NaN   90
Pankaj     NaN   60  NaN
Ramlal     NaN   50  NaN
Sumitra     30  NaN  NaN